app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Montevideo"], ["created_at", "2020-03-17 01:25:30.789528"], ["updated_at", "2020-03-17 01:25:30.789528"]]
---
  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save