app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
SELECT "towns".* FROM "towns" WHERE "towns"."city_id" = $1  [["city_id", 1]]
---
  def index
    @cities = City.all.preload(:towns).as_json(include: :towns)