app/controllers/news_controller.rb

  def index
    @ret = News.all
---
SELECT "news".* FROM "news"