app/controllers/posts_controller.rb

  def index
    @ret = []
    @posts = Post.all
    @posts.each do |p|
      @town = Town.find(p.town_id)
      @user = User.find(p.user_id)
      @city = City.find(@town.city_id)
---
SELECT "posts".* FROM "posts"
SELECT "towns".* FROM "towns" WHERE "towns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    puts "entre create post"
    @previous_post = Post.where(user_id: @current_user.id).first
    puts "pase previuos"
    puts @previous_post.as_json
    if @previous_post != nil
      puts "error"
      render :json => {:error => "No peudes realizar otro pedido"}.to_json, :status => 422
      #format.json { render json: "No puedes realizar otro pedido", status: :unprocessable_entity }
    else
      @post = Post.create!(description: params[:description],title: params[:title], town_id: params[:town_id], user_id: @current_user.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" ASC LIMIT $2  [["user_id", 12], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "user_id", "town_id", "created_at", "updated_at", "offering") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "primsdfsd"], ["description", "hhhh"], ["user_id", 12], ["town_id", 1], ["created_at", "2020-03-19 14:48:00.260137"], ["updated_at", "2020-03-19 14:48:00.260137"], ["offering", false]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 13]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]