app/controllers/products_controller.rb

  def index
    @ret = []
    @products = Product.all
    @products.each do |p|
      @town = Town.find(p.town_id)
      @user = User.find(p.user_id)
      @city = City.find(@town.city_id)
      @shop = Shop.find(p.shop_id)
---
SELECT "products".* FROM "products"
SELECT "towns".* FROM "towns" WHERE "towns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show
    @town = Town.find(@product.town_id)
    @user = User.find(@product.user_id)
    @city = City.find(@town.city_id)
    @shop = Shop.find(@product.shop_id)
---
SELECT "towns".* FROM "towns" WHERE "towns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @shop = Shop.where(name: params[:shop_name].to_s).first
    if @shop==nil
      @shop = Shop.create!(town_id: params[:town_id], name:params[:shop_name])
    end
    @product = Product.create!(shop_id: @shop.id,available: params[:available], return_date:params[:return_date],name: params[:name],price: params[:price], town_id: params[:town_id], user_id: @current_user.id)
---
SELECT "shops".* FROM "shops" WHERE "shops"."name" = $1 ORDER BY "shops"."id" ASC LIMIT $2  [["name", ""], ["LIMIT", 1]]
INSERT INTO "shops" ("name", "town_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "El tunel"], ["town_id", 1], ["created_at", "2020-03-17 14:29:30.526359"], ["updated_at", "2020-03-17 14:29:30.526359"]]
INSERT INTO "products" ("name", "price", "available", "created_at", "updated_at", "user_id", "town_id", "shop_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_product
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]