app/controllers/towns_controller.rb

  def create
    @town = Town.new(town_params)

    respond_to do |format|
      if @town.save
---
INSERT INTO "towns" ("name", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carrasco"], ["city_id", 1], ["created_at", "2020-03-17 01:29:43.264273"], ["updated_at", "2020-03-17 01:29:43.264273"]]

    def set_town
      @town = Town.find(params[:id])
---
SELECT "towns".* FROM "towns" WHERE "towns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]