app/controllers/users_controller.rb

  def login
    puts "login entre"
    @user = User.where(email: params[:email].to_s.downcase).first()
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "maavimartinez@gmail.com"], ["LIMIT", 1]]

  def create
    @user = User.create!(first_name: params[:first_name], last_name: params[:last_name], email: params[:email].to_s.downcase, phone: params[:phone], password: params[:password])
---
INSERT INTO "users" ("firstName", "lastName", "email", "password", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"